Repository: stevenkellner/strafen
Catalog: Strafen/Localizations/*/*.lproj/ErrorMessages.strings
Languages: de

# emptyField
source: This field can not be empty!
de: Dieses Feld darf nicht leer sein!

# invalidEmail
source: This is not a valid email!
de: Dies ist keine gültige Email!

# tooFewCharacters
source: Password is too short!
de: Passwort ist zu kurz!

# noUpperCharacter
source: Must contain an uppercase letter!
de: Muss einen Großbuchstaben enthalten!

# noLowerCharacter
source: Must contain an lowercase letter!
de: Muss einen Kleinbuchstaben enthalten!

# noDigit
source: Must contain a number!
de: Muss eine Zahl enthalten!

# notSamePassword
source: Passwords do not match!
de: Passwörter stimmen nicht überein!

# internalErrorSignIn
source: There was a problem registering!
de: Es gab ein Problem beim Registrieren!

# internalErrorLogIn
source: There was a problem signing in!
de: Es gab ein Problem beim Anmelden!

# alreadySignedInEmail
source: This email is already registered!
de: Diese Email ist bereits registriert!

# alreadySignedIn
source: You're already registered!
de: Du bist bereits registriert!

# weakPassword
source: The password is too weak!
de: Das Passwort ist zu schwach!

# clubNotExists
source: There is no club with this identifier!
de: Es gibt keinen Verein mit dieser Kennung!

# noRegionGiven
source: No region specified!
de: Keine Region angegeben!

# notEuro
source: Only works in countries with euros!
de: Funktioniert nur in Ländern mit Euro!

# identifierAlreadyExists
source: Club identifier is already taken!
de: Vereinskennung ist bereits vergeben!

# incorrectPassword
source: The password you entered is incorrect!
de: Das eingegebene Passwort ist falsch!

# notSignedIn
source: You're not registered!
de: Du bist noch nicht registriert!

# internalErrorSave
source: There was a problem saving!
de: Es gab ein Problem beim Speichern!

# amountZero
source: Amount can't be zero!
de: Betrag darf nicht Null sein!

# futureDate
source: Date can't be in the future!
de: Datum darf nicht in der Zukunft liegen!

# invalidNumberRange
source: Number must be between 1 and 99!
de: Anzahl muss zwischen 1 und 99 liegen!

# internalErrorDelete
source: There was a problem deleting!
de: Es gab ein Problem beim Löschen!
